# Imports / Dependencies

##### Import any dependencies -- Python libraries

In [1]:
import pandas as pd

##### Read in the dataset, and assign it to a variable

In [2]:
wages = pd.read_csv('Seattle_Wages_Data.csv')

# Get a sense of the data

##### How many rows and columns are in the dataset? -- Hint : Use the shape attribute

In [3]:
wages.columns

Index(['Department', 'Last Name', 'First Name', 'Job Title', 'Hourly Rate '], dtype='object')

##### Get the first five rows of the dataset -- Hint : Use the head() method

In [6]:
wages.head()

,Department,Last Name,First Name,Job Title,Hourly Rate
0,Arts and Culture,Boas-Du Pree,Sandra,Admin Staff Asst,34.48
1,Arts and Culture,Bolisay,Ronald,Publc Relations Spec,29.09
2,Arts and Culture,Chai,Grace,Cooperative Intern *,16.12
3,Arts and Culture,Childers,Calandra,"StratAdvsr3,Exempt",48.71
4,Arts and Culture,Crooks,Jennifer,Arts Prgm Spec,35.93

##### Get the last five rows of the dataset -- Hint : Use the tail() method

In [7]:
wages.tail()

,Department,Last Name,First Name,Job Title,Hourly Rate
12341,Seattle Public Utilities,Zemmerman,Ahanu,Maint Laborer,25.39
12342,Seattle Public Utilities,Zoellmer,Adam,"Trng&Ed Coord,Sr",37.94
12343,Seattle Public Utilities,Zollman,Karen,"Civil Engrng Spec,Sr",48.84
12344,Seattle Public Utilities,Zurowski,Allan,Carpenter,32.88
12345,Seattle Public Utilities,Zuver,Glen,"Constr&Maint Equip Op,Sr",34.75

##### Get the dataset's column names and datatypes -- Hint : Use the info() method

In [8]:
wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12346 entries, 0 to 12345
Data columns (total 5 columns):
Department      12346 non-null object
Last Name       12346 non-null object
First Name      12346 non-null object
Job Title       12346 non-null object
Hourly Rate     12346 non-null float64
dtypes: float64(1), object(4)
memory usage: 482.3+ KB

##### Get summary statistics of the dataset -- Hint : Use the describe() method

In [9]:
wages.describe()

       Hourly Rate
count  12346.000000
mean      38.974306
std       13.724498
min        5.110000
25%       28.830000
50%       38.850000
75%       48.430000
max      166.910000

# Data cleaning

##### Sort the dataset (from the highest wages to lowest) -- Hint : Use the sort_values() method

In [15]:
wages['Hourly Rate '].sort_values(ascending=False)

1879     166.91
11455    134.10
7486     127.68
199      116.54
959      111.24
101      109.74
1960     109.58
3554     107.84
103      107.07
824      105.00
1312     103.38
3058     102.08
2871     102.08
3661     102.08
2990     102.07
6244      99.55
7261      99.55
91        98.66
941       96.97
8010      96.66
7313      96.66
7842      96.66
6449      96.66
1066      95.79
4572      95.14
609       93.88
4338      93.48
2464      93.15
9791      91.94
1798      91.21
          ...
5591      15.00
6022      15.00
5415      15.00
3842      15.00
3953      15.00
3837      15.00
5238      15.00
3880      15.00
4946      15.00
3834      15.00
3936      15.00
4609      15.00
3876      15.00
3927      15.00
3942      15.00
3943      15.00
3948      15.00
5248      15.00
4989      15.00
1967       5.53
1968       5.53
1971       5.53
1973       5.53
1974       5.53
1969       5.53
4254       5.11
4258       5.11
4238       5.11
4236       5.11
4225       5.11
Name: Hourly Rate , Length: 12346, dtype: float64

# Querying the data

##### How many jobs are there in the dataset? -- Hint : Use the describe() method after indexing on 'Job Title'

In [19]:
wages.info(Job Title)

SyntaxError: invalid syntax (<ipython-input-19-6734a053725c>, line 1)

##### What is the highest salary? Save that output to a variable -- 'wage_max'. -- Hint : Use the max() method

In [20]:
wage_max = wages['Hourly Rate '].max()

##### Who is the highest earning individual in the dataset? -- Hint : Use boolean indexing for the max 'Hourly Rate ' value

In [22]:
wages[wages['Hourly Rate '] == wage_max]

,Department,Last Name,First Name,Job Title,Hourly Rate
1879,City Light,Weis,Larry,City Light General Mgr&CEO,166.91

##### How many people work at the highest earning indivdiual's department? -- Hint : Use the count() method

In [25]:
City_Light_employees = wages[wages['Department'] == 'City Light']

In [27]:
City_Light_employees.count()

Department      1850
Last Name       1850
First Name      1850
Job Title       1850
Hourly Rate     1850
dtype: int64

##### What is the lowest salary? Save that output to a variable -- 'wage_low'. -- Hint : Use the min() method

In [30]:
wage_low = [wages['Hourly Rate '].min()]

In [31]:
wage_low

[5.11]

##### Who is the lowest earning individual in the dataset? -- Hint : Use boolean indexing for the min 'Hourly Rate ' value

In [32]:
wages[wages['Hourly Rate '] == wage_low]

,Department,Last Name,First Name,Job Title,Hourly Rate
4225,Legislative-City Council,Felder,Donald,OPA Review Board Member,5.11
4236,Legislative-City Council,Hawe,William,OPA Review Board Member,5.11
4238,Legislative-City Council,Holohan,Elizabeth,OPA Review Board Member,5.11
4254,Legislative-City Council,Levytsky,John,OPA Review Board Member,5.11
4258,Legislative-City Council,Marks,Alfred,OPA Review Board Member,5.11

##### How many people work at the lowest earning indivdiual's department? -- Hint: Use the count() method

In [36]:
Legislative_City_Council = wages[wages['Department'] == 'Legislative-City Council']
Legislative_City_Council.count()

Department      106
Last Name       106
First Name      106
Job Title       106
Hourly Rate     106
dtype: int64

##### What is the difference between the highest earning and lowest earning individuals?

In [37]:
wage_max - wage_low

array([161.8])

# Stop Point!